#Выведите первый и последний элемент списка.
a=input("Введите элементы списка через запятую без пробелов: ").split(',')
print("Певый элемент: ",a[0])
print("Последний элемент: ",a[-1])