#Напишите программу для слияния нескольких словарей в один.
a={1: "home", 2: "alone", 3: "hell"}
b={5: "mad", 6: "cat", 7: "ring"}
ab=a|b
print(ab)